Revit 2027 API
FabricationPartBrowserChangedEventArgs.NumberOfSolutions Property
 The number of active solutions in routing solution mode.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfSolutions { get; }
Public ReadOnly Property NumberOfSolutions As Integer
	Get
public:
property int NumberOfSolutions {
	int get ();
}
member NumberOfSolutions : int with get
Property Value
Int32
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace